#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan for stage environment</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gcs_bucket.google_storage_bucket.ml_bucket will be created
  + resource "google_storage_bucket" "ml_bucket" {
      + effective_labels            = {
          + "environment"                = "stage"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
          + "team"                       = "mlops"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + labels                      = {
          + "environment" = "stage"
          + "managed_by"  = "terraform"
          + "team"        = "mlops"
        }
      + location                    = "US-CENTRAL1"
      + name                        = "mycompany-mlops-stage-mlops-data"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "environment"                = "stage"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
          + "team"                       = "mlops"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

**Target Environment:** `stage`
**Plan shows changes that will be applied when this PR is merged**

*Triggered by: @Cpicon, Action: pull_request*